{"pages":[{"title":"","text":"个人简介 技能 java 主要用于编写server端，接触契机是上中专时一个很厉害的同学带我入门的。当时喜欢玩一些独立游戏，没有专用服务器，只能自己搭建。最初从静态网页开始，到个人网站，再到靠java吃饭； python 工作后一个同事带我入坑的，从这以后认识到只会一门语言远远不够，python还有更多的功能，但自己能力有限（api战士），使用范围仅限于脚本了； 爱好 钓鱼 这种快乐可能类似于钓鱼执法吧，🐟上钩那一刻特别兴奋，很享受这个过程与结果； 摄影 喜欢拍摄动植物、人像，相对于万年不变的绿水青山，更喜欢记录转瞬即逝的画面； 电影 偏向于历史、纪录片、演技派、内涵向、纯喜剧 例如切尔诺贝利、姜文系列、周星驰系列、辛德勒的名单、绿皮书、了不起的盖茨比； 音乐 华语独爱周杰伦，小学时听刘德华、港台、欧美网络热曲比较多。初中开始深度接触周杰伦才认识到什么是无敌。即使放在21年，依旧有新鲜感； 动画 追番观看200+ 喜欢有充实内容或画面表现力有独特理解的 例如：物语系列、来自新世界、进击的巨人、怪化猫、动物狂想曲、昨日之歌、eva、天气之子、夏目友人帐等； 骑行 机械式的传动结构令我满足，还比较喜欢摩托车，但是不会…曾经陪朋友出去放松，决定从哈尔滨开始长白山为目的地，结果到吉林的时候遇到了50年不遇的暴风雨走到舒兰便打道回府了，完成度1/3。后来还有一次从北京带猫回家，单日行程170km； 优势 为人方面 和善、坦诚，直爽、靠谱，不好意思我就是那超越99%的完美人（工具人），我的朋友（用过我的人）没有不说好； 三人行必有我师 我会分析他人优点，将一点我所欠缺的素养，加以特色化适应学习； 相对来说还算有悟性 劣势 计划 2021-GOALS 开发早季2.0.1（server,android,ios,web）； 8月份开始健身，一周最少2次，形成习惯。 作息要尽可能有规律10点30后必须熄灯上床睡觉，形成习惯； 生活健康一些，戒可乐； 整理搭建桌面，让开发环境尽可能舒适一些； 尽可能参与社交活动，不能宅起来，比如找一下类似于服务生的兼职； 尽可能减少非开发屏幕使用占比； 心路历程转折点","link":"/about/index.html"},{"title":"","text":"猫 董烨 动物 街景 人文 标志 图片版权属于声控周不鸽","link":"/album/index.html"},{"title":"","text":"来而不往非礼也畅所欲言，有留必应","link":"/message/index.html"},{"title":"","text":"申请友链须知 原则上只和技术类博客交换，但不包括含有和色情、暴力、政治敏感的网站。 不和剽窃、侵权、无诚信的网站交换，优先和具有原创作品的网站交换。 申请请提供：站点名称、站点链接、站点描述、logo或头像（不要设置防盗链）。 排名不分先后，刷新后重排，更新信息后请留言告知。 会定期清理很久很久不更新的、不符合要求的友链，不再另行通知。 本站不存储友链图片，如果友链图片换了无法更新。图片裂了的会替换成默认图，需要更换的请留言告知。 本站友链信息如下，申请友链前请先添加本站信息： 网站图标：https://cdn.jsdelivr.net/gh/sakiraven/imgs/blog/51615538.jpeg 网站名称：声控周不鸽 网站地址：https://sakiraven.github.io 网站简介：后端开发，技术分享 加载中，稍等几秒...","link":"/friend/index.html"},{"title":"","text":"碎碎念 tips：github登录后按时间正序查看、可点赞加❤️、本插件地址..「+99次查看」 碎碎念加载中，请稍等... $.getScript(\"/js/gitalk_self.min.js\", function () { var gitalk = new Gitalk({ clientID: 'c98812d0bb3bbe80e27d', clientSecret: '55b5732118689aa56a99d5a8de7bae79198f9b1a', id: '自说自话', repo: 'blog-comment', owner: 'sakiraven', admin: \"sakiraven\", createIssueManually: true, distractionFreeMode: false }); gitalk.render('comment-container1'); });","link":"/self-talking/index.html"}],"posts":[{"title":"HelloWord","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2021/05/28/hello-world/"}],"tags":[{"name":"test","slug":"test","link":"/tags/test/"}],"categories":[{"name":"algorithm","slug":"algorithm","link":"/categories/algorithm/"}]}