{"pages":[{"title":"友链","text":"申请友链须知 原则上只和技术类博客交换，但不包括含有和色情、暴力、政治敏感的网站。 不和剽窃、侵权、无诚信的网站交换，优先和具有原创作品的网站交换。 申请请提供：站点名称、站点链接、站点描述、logo或头像（不要设置防盗链）。 排名不分先后，刷新后重排，更新信息后请留言告知。 会定期清理很久很久不更新的、不符合要求的友链，不再另行通知。 本站不存储友链图片，如果友链图片换了无法更新。图片裂了的会替换成默认图，需要更换的请留言告知。 本站友链信息如下，申请友链前请先添加本站信息： 网站图标：https://cdn.jsdelivr.net/gh/sakiraven/imgs/blog/51615538.jpeg 网站名称：声控周不鸽 网站地址：life.sakikun.com 网站简介：后端开发，技术分享 加载中，稍等几秒...","link":"/friend/index.html"},{"title":"相册","text":"猫 董烨 动物 街景 人文 标志 图片版权属于声控周不鸽","link":"/album/index.html"},{"title":"自述","text":"最初搭建博客目的 灵感来源 最初是自第二份工作后4个月开始，从项目经理身上学到的工作日志记录习惯（后续还有一个日常日志app的想法）期间虽然记录的很简单，有得一笔带过，有的记录可能细节丢失，回过头来看看还挺享受的这个过程的； 便于管理 上述过程中分化成三部分笔记，工作日志（记录每天工作内容）个人项目开发日志（对于个人项目学习过程）辞职后的生活日志（相对综合什么都有写）承载平台为有道云笔记，整体相对比较杂乱，不方便管理。个性化的博客主题模板，分类、归档、标签，这些功能正好切中要害，满足自身需求； 监督作用 作为个人开发者工作与学习需要极强的意志力，我认为自己只存在一定的自控力。将生活发布于互联网，会有种督促自身的感觉。相当于每天都在立flag，如果实现不了可太丢人了； 作为简历 因为暂时不工作，为了证明自己还处于码圈，并且持续在以个人开发者身份工作； 为什么放弃工作 趁着年轻，追逐下梦想，有一个搭建核心向社区的idea； 职业规划有三个阶段，第1年能力达到组长能力，2-4年达到项目经理级别，4-???年要摸到更高的层次，但还没具体想到。也是想开始尝试下第二阶段； 学习计划，过去两年的学习方式是扩大广度，各方面的技术点都有接触使用，现在依旧在拓宽接触范围比如移动原生开发，同时想挖掘下server端的深度； 想尝试一下面对网络用户的移动平台，站在产品角度思考功能，作为项目经理来规划业务，挑战架构师的工作设计符合业务与局限性能下的技术选型； 计划做数款ios平台app来提高产品能力； &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;因为《中专学历》，面试通知率极低，因为《年纪小，但成熟》《价格便宜，但能力还算不错》两项主要优势入职通过率极高。但随着时间的推移，等我到24岁时同龄本科生可能已经工作一两年，又或者研究生快毕业，再与他们竞争将毫无优势可言。所以我想通过被迫”独自”的形式维护一个”用户级”的社区平台来提高自身的各项能力。再与他人竞争时，别人可能在讨论代码技术点，而我想在产品、技术选型、业务、运维等角度与面试官讨论； 个人简介 技能 java 主要用于编写server端，接触契机是上中专时一个很厉害的同学带我入门的。当时喜欢玩一些独立游戏，没有专用服务器，只能自己搭建。最初从静态网页开始，到个人网站，再到靠java吃饭； python 工作后一个同事带我入坑的，从这以后认识到只会一门语言远远不够，python还有更多的功能，但自己能力有限（api战士），使用范围仅限于脚本了； javascript 主要用于web前端的逻辑，用过的框架只有jquery和vue。老实说在接触MVVM之前很讨厌写web前端代码，有大量的填充节点代码，拼接起来很痛苦; swift 我是苹果老脑残粉了，可能是因为信仰加持，配合swiftUI感觉代码写起来的感觉很舒适…就很玄学，现在社区2.0.1的原型是现在苹果端编写的； dart 还有没开始使用，当初决定踏足移动端时看向android与ios，比较之下选择了更陌生的ios先入坑，如果ios都不无法拿下那就不打算浪费时间了，使用dart主要是为了flutterUI； 爱好 钓鱼 这种快乐可能类似于钓鱼执法吧，🐟上钩那一刻特别兴奋，很享受这个过程与结果； 摄影 喜欢拍摄动植物、人像，相对于万年不变的绿水青山，更喜欢记录转瞬即逝的画面； 电影 偏向于历史、纪录片、演技派、内涵向、纯喜剧 例如切尔诺贝利、姜文系列、周星驰系列、辛德勒的名单、绿皮书、了不起的盖茨比； 音乐 华语独爱周杰伦，小学时听刘德华、港台、欧美网络热曲比较多。初中开始深度接触周杰伦才认识到什么是无敌。即使放在21年，依旧霸榜华语乐坛； 动画 追番观看200+ 喜欢有充实内容或画面表现力有独特理解的 例如：物语系列、来自新世界、进击的巨人、怪化猫、动物狂想曲、昨日之歌、eva、天气之子、夏目友人帐等； 骑行 机械式的传动结构令我满足，还比较喜欢摩托车，但是不会…曾经陪朋友出去放松，决定从哈尔滨开始长白山为目的地，结果到吉林的时候遇到了50年不遇的暴风雨走到舒兰便打道回府了，完成度1/3。后来还有一次从北京带猫回家，单日行程170km； 优势 学习方面 三人行必有我师，我会分析他人优点，将一点我所欠缺的素养，加以特色化适应学习，这么多年来我非常感谢身边的每个朋友，我认为你们是我最好的老师。还算有悟性，当受人点拨时，可以相对较快的领悟，同时有一定的举一反三能力。除此之外学习知识大多来源于互联网，有较强的辨识能力； 为人方面 和善，任何时候都不会主动交恶。坦诚，我以双赢为目的。直爽，当有人询问我意见或者问答时，有什么说什么，不会拖泥带水。体贴，公开场合我非常注意不让他人受到冷落或者处于尴尬境地，如果要尴尬我希望那个人是说。不好意思我就是那超越99%的完美人（工具人），我的朋友（用过我的人）没有不说好； 劣势 学习方面 很怠惰，没办法向那些热爱学习的人一样，以学代休，下班时我想的还是娱乐至上； 为人方面 非常慢热，会给那些不熟悉我的人一种阴冷的感觉，不是那么近人，主要原因是从前是个社恐。再有就是和没有共同话题的人，非工作原因几乎无法聊起来，不是我不愿意和这些人接触，而是我不知道切入点； 年度短期计划 2021-UNCOMPLETED 8月份开始尝试健身； 尽可能减少非开发屏幕使用占比； 开发社区2.0.1以ios作为原型端； 整理搭建桌面，让开发环境尽可能舒适一些； 生活健康一些，戒可乐，作息要尽可能有规律10点30后必须熄灯上床睡觉； 2022-UNCOMPLETED 将健身养成习惯； 尽可能参与社交活动，不能宅起来，比如找一下类似于服务生的兼职； 开发ios、android、win、web任意平台10款app； 开发社区2.1.1（andriod，iso，web，server）6月份之前完成决定发行版，并在年底累计万名用户注册； 心路历程转折点","link":"/about/index.html"},{"title":"","text":"计划这些年来的学习对象与帮助过我的人回忆一下 未完待续…","link":"/thanks/index.html"},{"title":"留言","text":"来而不往非礼也畅所欲言，有留必应","link":"/message/index.html"},{"title":"自说自话","text":"碎碎念 tips：github登录后按时间正序查看、可点赞加❤️、本插件地址..「+99次查看」 碎碎念加载中，请稍等... $.getScript(\"/js/gitalk_self.min.js\", function () { var gitalk = new Gitalk({ clientID: 'c98812d0bb3bbe80e27d', clientSecret: '18dd21afa9cbf7a9790197ae6a90c8d83bb72f41', id: '自说自话', repo: 'blog-comment', owner: 'sakiraven', admin: \"sakiraven\", createIssueManually: true, distractionFreeMode: false }); gitalk.render('comment-container1'); });","link":"/self-talking/index.html"}],"posts":[{"title":"来自新世界的第一期","text":"第一天，我叫李子晗，初次见面请多指教； liangqj 感谢各位像素元同事们这1年的照顾与指导，万分感谢项目经理吴周检给我这次工作机会，让我接触到了很多高学历人才，受到很多人的点拨： 晶姐教导我如何消除与他人沟通的误差； 受思捷影响使我变得愈发冷静； 华哥让我认识到身体健康的重要； 高明哥给我了一个奇妙的思维方式； fox带我走进了多语言的大门； 大灰涛让深刻体会到思维导图的重要性； 与吴哥的相处中学到了一些项目管理的思路与技巧； 今天是在公司的最后一天，明天就要开始新生活了，提出离职这两个星期与我模拟离职的心态一致，忐忑、不安、迷惘，好在有过预演，两天时间也算是接受了现实。与当初来杭州找工作不同，如今面临了更大的挑战，当初曾开玩笑说找不到工作便沉西湖底，如今便是要应验了，但还是希望自己可以体面一点。回归正轨后主要在做： 搭建个人博客； 未来租房在哪里； 规划下未来半年的计划，想做的有很多，但要安排好先后顺序； 未来兼职方向，倾向于服务行业或志愿者，主要是不想让自己脱离社会实践与人际交往； 打通了一下微信支付，刷一下流水，尝试开通企业付款到零钱（不知道这种做法是否可行），为社区提现功能提前铺垫； 最后一日，我叫李子晗，还望大家日后不要吝啬指教；","link":"/2021/05/31/hello-world/"},{"title":"来自新世界的第二期","text":"今日完成情况 继续做app原型，其实大致框架早在3月份基本完事了，剩下的都是微调，当然还要充实下功能，这个需要个长期的思考，估计20个工期可以完成初版原型app； 下午时思考将废置笔记本利用起来，想搭建一个ftp服务器，然后让工作机加载网络驱动实现录制视频直接存储与ftp不占用工作机空间，不知道是否可行； ftp还没开始搭建，无意间发现了上学时与同学们做的网站，以现在的要求来看可以说是十分”简陋”了，但是承载了很多回忆，正好趁着6.1发布出来让大家回一下哈；","link":"/2021/06/01/hello-world2/"},{"title":"来自新世界的第三期","text":"摘要今日主要围绕虚拟机docker环境抉择，与日后计划； 今日完成情况尝试win环境搭建docker，想将alienware改造为服务器 家庭版成功安装hyper-v，并且伪装为专业版安装docker desktop但是docker服务存在一个异常问题； docker version 及其他指令报错提示1error during connect: This error may indicate that the docker daemon is not running.: Get &quot;http://%2F%2F.%2Fpipe%2Fdocker_engine/v1.24/version&quot;: open //./pipe/docker_engine: The system cannot find the file specified. 根据面相互联网开发思想，给出的多数答案改为Windows Containers，但是对我无效； 互联网多数解决方案12cd &quot;C:\\Program Files\\Docker\\Docker&quot;DockerCli.exe -SwitchDaemon 在尝试无果后，感觉win10环境也着实不适合搭建服务，开始思索做个ubuntu20.04server版本双系统。在使用u起安装系统时最后一步出现一个error，不想追究，失败告终； 思考下还是决定依赖hyper-v开启一个虚拟机，win10平台相对熟悉，了解如何压制cpu频率，后续相对省电； 兼职 遇到了一个很有意思的兼职工作，游戏体验馆，这我不无敌了吗？10年游戏经验，贾德诺； 截图 计划每周5面试一次，出于两点考虑； 现阶段遇到瓶颈，看看是否有机会受到高人指点； 万一遇到很合适的公司呢；","link":"/2021/06/02/hello-world3/"},{"title":"来自新世界的第四期","text":"摘要同学来杭州工作了，接待一下； 今日完成情况同学来杭州了 聊的过程中决定明天出去玩一天散散心，想去森海塞尔线下实体店体验下HD600； 在帮忙找住处，吹水的一天，吐槽下当年上学的时候挺有意思的，期待更多的朋友来杭； 在规划一个工具类型app优于社区先开发，这方面先拿AppStore试试水如果效果可以尝试开发华为版本，详情稍后发布； 思考了一下把周五的面试推了，本来计划辞职是要沉淀一段时间，现在去面试有悖于当初的决定，就算是为了去咨询问题也要先积累一定问题吧； 安装win10系统 毁灭吧赶紧的，使用UltraISO工具制作win10镜像中途总是报错，自带的恢复系统中途失败，受不了了，就很离谱。最后再尝试下微软官网下载的升级工具，再不行的话，毁灭吧赶紧的；","link":"/2021/06/03/hello-world4/"},{"title":"来自新世界的第五期","text":"摘要喝完酒第二天：头好疼，以后再也不喝酒了。到了酒桌上：给爷满上，不喝断片不许走！ 2021-06-04准备出发9点30出门前往法喜寺，路线为长河6号线坐到枫华西路，然后公交到达上天竺。中途在枫华西路等了30分钟才发车，期间在思考要不要住到这边来，感觉房租价格，地段都还可以。随后找了一个中介吹水一会，我表达出是想了解下附近租房情况，简单聊聊。但这个老哥属实有点”热情”，说要电话详聊（我挺反感这种情况的，一般非工作、快送员，又或是重要事情以外的电话我都会很乏感，能打字就别语音）发车后没有再回复； 到达也就是在法喜寺转了一圈，网红景点散散心。前段时间不是挺郁闷的嘛，但好在自己的抗压能力一直不错，心态调整极其迅速，还没来得及放松自己就已经恢复了。期间有抓拍到一张不错的照片还是比较满意的； 超喜欢的机位 返程下午吃完饭已经16点了，本来还打算去森海塞尔线下体验一下hd600（最近在考虑买音响还是耳机）但实体店18点就打烊了，我过去需要1小时，不喜欢将时间排的太赶。我宁可日后再去，回去了回去了； 到家以后还是这个中介，就很有意思，又来微信我。先问我是否要过去看房，但我之前就已经说清楚只是了解下。最最最有意思的是居然叫我过去工作面试…我人都傻了，就感觉很有意思，其实我现在比较需要一份每天只做4小时的工作，工资不需要很多够吃喝就行。但很显然不能进”传销”，每天早起那些房地产的员工跳舞，喊着努力加油什么的，比996是福报听起来还要恐怖； 聊天记录 意外情况华哥（像素元的同事）叫我小聚一下，和应用组的那些朋友。原本是说周一我离职那天聚的（也就是5月31日）可是大家都很忙没有时间，然后又说改日再聚，我以为最后就不了了之了。今天是很累了已经，但希望可以保持住与大家的联系。同事都是年轻人，没有那么多的利益交往，人际环境相对纯粹，非常珍惜； 我本身很讨厌酒类，感觉不好喝（哪里有肥宅水快乐，话说已经戒了）可能也是因为没有喝过那种”好酒”。我只是喜欢喝醉，身心酥麻的感觉，以至于平时会喝一些强效酒精饮料，比如四洛克，致醉效果非常nice。酒一上头嘴就碎起来了，讲了很多心里话，吐槽了很多工作的事情，说一说我为什么离职，为什么如此急于求进…反正就没停下来，因为平时交流就比较少，停下来我怕会冷场，我怕就这样结束了，我想尽可能的表达下自己的情感； 回去的时候，我知道是超哥掺我上的车，下车时我是爬下去的，菊花接的我，至于小单车🚴‍️是思捷帮我骑回来的； 仅存的一张现场照 2021-06-05头疼疼醒的，一点精神没有，想睡睡不着，看会视频直接暴毙，最后只能眯眼装死。中午也不知道吃什么，就点了份皮蛋瘦肉粥，点完就后悔了，太腻了，应该搞碗小米粥。随后睡了一会儿，被菊花吵醒，这个13应该是在写公众号文章，伴随着敲击机械键盘的声音，心中一万只草泥马奔腾而过。状态稍微好了一点点，但不想说话，菊花的问话也是爱答不理，稍微修了下昨天的图便24点了，今天就这样完结。 有个好消息，菊花的工作面试有起色了； 2021-06-06win本重做了系统，破解升级成专业版，这次docker的安装十分顺利。搭建了一个ftp服务器，但我设想的那种使用方式不太行，在mac录制视频，将存储地址设置为ftp地址，就…算了算了，不搞这些花里胡哨的，再买个4t硬盘好了。","link":"/2021/06/06/hello-world5/"},{"title":"项目规划生命之旅其一","text":"摘要ios第一个开发企划； 想法出处工作期间有一次出差杭绍台，因为要汇报每日工作，写总结有的时候会漏掉一些事情的细节，可能按照大致阶段去写，领导也许会质疑为什么一天只做了这几件事情。但是从我角度出发，每件事可能需要很多的细节来填充。如果我不表达，领导肯定是不知道的，误会就这样产生。 后来在想有没有类似日志框架的app来记录我的日行程动作，重要事件。 未完待续……","link":"/2021/06/03/project-planning-lifetrip/"},{"title":"每周回顾的第一幕","text":"摘要优先做出一个工具app，大战之前，先给自己加成一丢斗志； 本周总结 第一个阶段，因为辞职心情十分低落： 心痛、不安的情绪围绕着我，看不到一点光明，为未来的自己担心，觉得后半生就这样完蛋了。但也就仅此两天，我心态调整的还是很快的，除了恋爱没有我走不出的阴影； 第二个阶段就是寻找目标方向了： 月底房租到期之前租在哪里，是否能有朋友与我合租，租房位置与还不存在的兼职工作位置距离取舍： 目前最优选是萧山姑娘桥，优点是离董烨比较近，可以教我如何健身。最重要的是价格及其便宜。到达滨江长河只需要40分钟地铁。缺点是周边生活设施比较缺失，没有室友合租，只能找陌生人； 其次是下沙，优点是好兄弟胜楠在那里，一起住会很开心； 工作方向，是先做工具app尝试在AppStore销售一下，还是做梦想的社区app： 社区app是辞职的目标以及梦想，体量相对庞大，有很多东西要设计； 工具app功能很简单，唯一的要求是界面要美观！这个很重要，我的设计能力相当差劲，最后抉择之下选择先写工具app； 工作室的打造打造清单： aoc273显示器，价格2500； ipad 2020 + apple pencil，价格4000； 待选耳机或者音响，预算2000； 工作椅，对自己的腰好一些，预算1000-2000； 桌子预算300； 其他配件预算1000； 下周目标 完成工具app； 确定好清单； 多看一看ui设计，目标是当做产品时脑中有界面的画面；","link":"/2021/06/06/weekly-review1/"}],"tags":[{"name":"生活","slug":"生活","link":"/tags/%E7%94%9F%E6%B4%BB/"},{"name":"ios项目规划","slug":"ios项目规划","link":"/tags/ios%E9%A1%B9%E7%9B%AE%E8%A7%84%E5%88%92/"},{"name":"总结","slug":"总结","link":"/tags/%E6%80%BB%E7%BB%93/"}],"categories":[{"name":"日志","slug":"日志","link":"/categories/%E6%97%A5%E5%BF%97/"},{"name":"日记","slug":"日志/日记","link":"/categories/%E6%97%A5%E5%BF%97/%E6%97%A5%E8%AE%B0/"},{"name":"项目规划","slug":"项目规划","link":"/categories/%E9%A1%B9%E7%9B%AE%E8%A7%84%E5%88%92/"},{"name":"周记","slug":"日志/周记","link":"/categories/%E6%97%A5%E5%BF%97/%E5%91%A8%E8%AE%B0/"},{"name":"ios","slug":"项目规划/ios","link":"/categories/%E9%A1%B9%E7%9B%AE%E8%A7%84%E5%88%92/ios/"}]}